Terraform Plan:

```
[command]/home/runner/work/_temp/b866be25-31fa-4aa3-904c-aaf408036081/terraform-bin plan -out=tfplan
[0m[1maws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_security_group.example[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "example" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      [33m~[0m[0m description            = "Terraform security group" [33m->[0m[0m "Terra security group" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                     = "sg-0954367191803e0a8" -> (known after apply)
        name                   = "terra-security-group"
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m security_group_id = "sg-0954367191803e0a8" -> (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1maws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8][0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A[31m-[0m/[32m+[0m destroy and then create replacement[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_security_group.example[0m must be [1m[31mreplaced[0m%0A[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "example" {%0A      [33m~[0m[0m arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)%0A      [33m~[0m[0m description            = "Terraform security group" [33m->[0m[0m "Terra security group" [31m# forces replacement[0m[0m%0A      [33m~[0m[0m id                     = "sg-0954367191803e0a8" -> (known after apply)%0A        name                   = "terra-security-group"%0A      [32m+[0m[0m name_prefix            = (known after apply)%0A      [33m~[0m[0m owner_id               = "788932519567" -> (known after apply)%0A        tags                   = {%0A            "Name" = "example-security-group"%0A        }%0A        [90m# (5 unchanged attributes hidden)[0m[0m%0A    }%0A%0A[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.%0A[0m%0AChanges to Outputs:%0A  [33m~[0m[0m security_group_id = "sg-0954367191803e0a8" -> (known after apply)%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_2acfe6df-688c-464a-96f2-74cc32d7a13e
[0m[1maws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_security_group.example[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "example" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      [33m~[0m[0m description            = "Terraform security group" [33m->[0m[0m "Terra security group" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                     = "sg-0954367191803e0a8" -> (known after apply)
        name                   = "terra-security-group"
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m security_group_id = "sg-0954367191803e0a8" -> (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

ghadelimiter_2acfe6df-688c-464a-96f2-74cc32d7a13e
stderr<<ghadelimiter_ae62d185-326a-49f5-97ab-ef3baa5fdd82

ghadelimiter_ae62d185-326a-49f5-97ab-ef3baa5fdd82
exitcode<<ghadelimiter_37cbe5cd-771f-4590-a3ec-664749e72798
0
ghadelimiter_37cbe5cd-771f-4590-a3ec-664749e72798
```

Plan saved to GitHub artifacts.